In [1]:
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}

df = pd.DataFrame(data)
df

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
0        UTS1         Fisika                          571                 55
1        UAS1         Fisika                          379                 61
2        UTS2         Fisika                          569                 74
3        UAS2         Fisika                          503                 77
4        UTS1     Matematika                          260                 43
5        UAS1     Matematika                          637                 79
6        UTS2     Matematika                          617                 87
7        UAS2     Matematika                          717                 91
8        UTS1     Statistika                          521                 99
9        UAS1     Statistika                          792                 73
10       UTS2     Statistika                          684                 66
11       UAS2     Statistika                          639                 56

## Soal 1. Data Cleaning

Lakukan sorting data berdasarkan Rata2 nilai ujian dari terbesar ke terkecil

*   Lakukan sorting data berdasarkan Rata2 nilai ujian dari terbesar ke terkecil
*   Tipe Ujian dan Mata pelajaran apakah yang memiliki rata2 nilai terkecil?

In [2]:
#code here
print(df.sort_values("Rata2 Nilai Ujian", ascending = False), "\n")
print(df.sort_values("Rata2 Nilai Ujian", ascending = False).tail(1))

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
8        UTS1     Statistika                          521                 99
7        UAS2     Matematika                          717                 91
6        UTS2     Matematika                          617                 87
5        UAS1     Matematika                          637                 79
3        UAS2         Fisika                          503                 77
2        UTS2         Fisika                          569                 74
9        UAS1     Statistika                          792                 73
10       UTS2     Statistika                          684                 66
1        UAS1         Fisika                          379                 61
11       UAS2     Statistika                          639                 56
0        UTS1         Fisika                          571                 55
4        UTS1     Matematika                          260                 43

  Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
4       UTS1     Matematika                          260                 43

Expected output:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=1iv8P-LDdN3WpTVX9qST3kL7QSNSDiOc2)

<h2>Soal 2: Data Restructuring</h2>

Jelaskan itu pivoting dan melting data

Pivoting digunakan untuk merubah data yang berada pada posisi baris menjadi kolom sedangkatn melting data digunakan untuk merubah data yang berada pada posisi kolom menjadi baris

<h2>Soal 3: Reshaping Data 1</h2>

In [3]:
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}

df = pd.DataFrame(data)
df

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
0        UTS1         Fisika                          331                 91
1        UAS1         Fisika                          442                 59
2        UTS2         Fisika                          375                 49
3        UAS2         Fisika                          319                 75
4        UTS1     Matematika                          797                 88
5        UAS1     Matematika                          215                 63
6        UTS2     Matematika                          355                 87
7        UAS2     Matematika                          542                 81
8        UTS1     Statistika                          436                 91
9        UAS1     Statistika                          251                 51
10       UTS2     Statistika                          628                 51
11       UAS2     Statistika                          665                 95

Perhatikan data di atas, kemudian ubahlah bentuknya agar sesuai yang di harapkan.

In [4]:
#code here
df.pivot(index = "Tipe Ujian", columns = "Mata Pelajaran", values = ["Rata2 Nilai Ujian", "Rata2 Waktu Belajar (menit)"])

               Rata2 Nilai Ujian                        \
Mata Pelajaran            Fisika Matematika Statistika
Tipe Ujian
UAS1                          59         63         51
UAS2                          75         81         95
UTS1                          91         88         91
UTS2                          49         87         51

               Rata2 Waktu Belajar (menit)
Mata Pelajaran                      Fisika Matematika Statistika
Tipe Ujian
UAS1                                   442        215        251
UAS2                                   319        542        665
UTS1                                   331        797        436
UTS2                                   375        355        628

Expected Result:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=1XufsfqZe7-XZLsb92SpATexy-QRZE0ow)

<h2>Soal 4: Reshaping Data 2</h2>

In [5]:
import pandas as pd

data1 = {
    'Hari' : ['Sabtu', 'Minggu'],
    'Kebun Binatang' : [271, 399],
    'Dufan' : [501, 700],
    'Disney' : [1000, 1001],
    'Bali' : [900, 803]
}
df1 = pd.DataFrame(data1).set_index('Hari')
df1

        Kebun Binatang  Dufan  Disney  Bali
Hari
Sabtu              271    501    1000   900
Minggu             399    700    1001   803

diatas adalah data tentang jumlah pengunjung di berbagai tempat hiburan, ubahlah struktur data tersebut sehingga sesuai dengan hasil yang diharapkan.

In [6]:
#code here
df1 = df1.reset_index()
df1.melt(id_vars = ['Hari'], value_vars = ["Kebun Binatang", "Dufan", "Disney", "Bali"], 
         var_name = "Tempat Hiburan", value_name = "Pengunjung")

     Hari  Tempat Hiburan  Pengunjung
0   Sabtu  Kebun Binatang         271
1  Minggu  Kebun Binatang         399
2   Sabtu           Dufan         501
3  Minggu           Dufan         700
4   Sabtu          Disney        1000
5  Minggu          Disney        1001
6   Sabtu            Bali         900
7  Minggu            Bali         803

Expected Result:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=159mIqcyfeD30EEcyZmmkovORa6cZDLtn)

<h2>Soal 5: Data Enrichment</h2>

Lakukan binning data menggunakan qcut sehingga sesuai hasil yang diharapkan

In [7]:
#code here
df = pd.DataFrame(data)
ket = ["Tidak Lulus", "Remedial", "Lulus"]
df["Keterangan Kelulusan"] = pd.qcut(df["Rata2 Nilai Ujian"], q=3, labels=ket)

df

,Tipe Ujian,Mata Pelajaran,Rata2 Waktu Belajar (menit),Rata2 Nilai Ujian,Keterangan Kelulusan
0,UTS1,Fisika,331,91,Lulus
1,UAS1,Fisika,442,59,Tidak Lulus
2,UTS2,Fisika,375,49,Tidak Lulus
3,UAS2,Fisika,319,75,Remedial
4,UTS1,Matematika,797,88,Lulus
5,UAS1,Matematika,215,63,Remedial
6,UTS2,Matematika,355,87,Remedial
7,UAS2,Matematika,542,81,Remedial
8,UTS1,Statistika,436,91,Lulus
9,UAS1,Statistika,251,51,Tidak Lulus
10,UTS2,Statistika,628,51,Tidak Lulus
11,UAS2,Statistika,665,95,Lulus

Expected Output:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=1h2_u5_xhD1_QtPpItTj-o3lljHhnr4XS)